# todo:Прочитать главу 6 (стр. 119) книги SQL Полное Руководство.
Написать на модели данный ПО "Авторизации" запросы:
1. Простой запрос
2. Вычисляемый столбец
3. Выборка всех столбцов
4. Повторяющиеся строки (DISTINCT)
5. Отбор строк (WHERE) с оператором ставнения
6. Выборка одной строки
7. Проверка на принадлежность диапазону (BETWEEN)
8. Проверка наличия во множестве (IN)
9. Проверка на соответствие шаблону (LIKE)
10. Проверка на равенство NULL (is NULL)
11. Сопоставление условия отбора (AND, OR и NOT)
12. Сортировка результатов запроса (ORDER ВУ)
13. Объединение результов нескольких запросов (UNION)





